In [25]:
import pandas as pd

In [4]:
df=pd.read_csv('titanic_data.csv')

In [13]:
## Ans 1
df.head()
df.tail()
df.dtypes
df.columns
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Assignment 25 Feb

In [15]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]

In [18]:
df=pd.DataFrame(data={'course_name':course_name,'duration':duration})

In [19]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [22]:
## Ans 1.
print(df[1:2])

        course_name  duration
1  Machine Learning         3

In [ ]:
## Ans 2
## difference b/w iloc and loc is iloc counts the int in the data however the loc counts the indexes in the data

In [26]:
## Ans 3
var1={'num':[3,0,1,2]}

In [27]:
df1=pd.DataFrame(var1)

In [36]:
new_df=df1.reindex([3,2,1,0])

In [37]:
new_df

   num
3    2
2    1
1    0
0    3

In [30]:
df1

   num
0    3
1    0
2    1
3    2

In [38]:
new_df.loc[2]
## by using loc it counted the index no 2

num    1
Name: 2, dtype: int64

In [39]:
new_df.iloc[2]
## by usuing the iloc it counted the no 2 row

num    0
Name: 1, dtype: int64

In [40]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]

In [41]:
df2 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [42]:
df2

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.357669  0.725430  0.725073  0.787151  0.834961  0.361567
2  0.710652  0.986460  0.601230  0.684502  0.675652  0.795477
3  0.118366  0.820558  0.520793  0.312493  0.994656  0.127403
4  0.080448  0.340083  0.801831  0.629058  0.435086  0.049493
5  0.528839  0.086853  0.110559  0.833190  0.206004  0.485823
6  0.011494  0.648973  0.868742  0.556398  0.534884  0.818098

In [45]:
df2.mean()

column_1    0.301245
column_2    0.601393
column_3    0.604705
column_4    0.633799
column_5    0.613540
column_6    0.439643
dtype: float64

In [50]:
df2['column_2'].std()

0.3307546424324789

In [58]:
## Ans 5
df2['column_2']=df2['column_2'].astype('str')

In [59]:
df2

   column_1            column_2  column_3  column_4  column_5  column_6
1  0.357669   0.725430313418895  0.725073  0.787151  0.834961  0.361567
2  0.710652  0.9864599876859682  0.601230  0.684502  0.675652  0.795477
3  0.118366  0.8205577355062446  0.520793  0.312493  0.994656  0.127403
4  0.080448   0.340083351749355  0.801831  0.629058  0.435086  0.049493
5  0.528839  0.0868528306384646  0.110559  0.833190  0.206004  0.485823
6  0.011494  0.6489727003212629  0.868742  0.556398  0.534884  0.818098

In [60]:
type(df2['column_2'])

pandas.core.series.Series

In [66]:
df2.loc[df2['column_2'].mean()]

TypeError: Could not convert 0.7254303134188950.98645998768596820.82055773550624460.3400833517493550.08685283063846460.6489727003212629 to numeric

In [ ]:
## Ans 6.
##Window function is a popular technique used to analyze a subset with related values

In [67]:
##Ans 7
import datetime

In [68]:
timestamp=pd.Timestamp(datetime.datetime(2023,2,28))

In [69]:
print("Timestamp: ", timestamp)

Timestamp:  2023-02-28 00:00:00

In [1]:
import pandas as pd

In [3]:
todays_date=pd.date_range(start='2023-03-02',end='2023-03-02')

In [4]:
todays_date

DatetimeIndex(['2023-03-02'], dtype='datetime64[ns]', freq='D')

In [5]:
type(todays_date)

pandas.core.indexes.datetimes.DatetimeIndex

In [19]:
todays_date=pd.DataFrame(todays_date)

In [20]:
todays_date

           0
0 2023-03-02

In [21]:
todays_date['current_month']=todays_date[0].dt.month

In [22]:
todays_date

           0  current_month
0 2023-03-02              3

In [23]:
todays_date['current_year']=todays_date[0].dt.year

In [24]:
todays_date

           0  current_month  current_year
0 2023-03-02              3          2023

In [35]:
import datetime
date1 = datetime.date(int(input('input start date')))
print (date1)

input start date 2023-03-03

ValueError: invalid literal for int() with base 10: '2023-03-03'

In [38]:
import pandas as pd
import lmxl

ModuleNotFoundError: No module named 'lmxl'

In [37]:
sales=pd.read_html('https://www.kaggle.com/datasets/kyanyoga/sample-sales-data')

ImportError: lxml not found, please install it

In [39]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 3.8 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
import lmxl

ModuleNotFoundError: No module named 'lmxl'

In [4]:
sales=pd.read_csv('supermarket_sales - Sheet1.csv')

In [5]:
sales

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,233-67-5758,C,Naypyitaw,Normal,Male,Health and beauty,40.35,1,2.0175,42.3675,1/29/2019,13:46,Ewallet,40.35,4.761905,2.0175,6.2
996,303-96-2227,B,Mandalay,Normal,Female,Home and lifestyle,97.38,10,48.6900,1022.4900,3/2/2019,17:16,Ewallet,973.80,4.761905,48.6900,4.4
997,727-02-1313,A,Yangon,Member,Male,Food and beverages,31.84,1,1.5920,33.4320,2/9/2019,13:22,Cash,31.84,4.761905,1.5920,7.7
998,347-56-2442,A,Yangon,Normal,Male,Home and lifestyle,65.82,1,3.2910,69.1110,2/22/2019,15:33,Cash,65.82,4.761905,3.2910,4.1
999,849-09-3807,A,Yangon,Member,Female,Fashion accessories,88.34,7,30.9190,649.2990,2/18/2019,13:28,Cash,618.38,4.761905,30.9190,6.6

In [6]:
sales.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [6]:
sales.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [7]:
sales[['Product line','Unit price']]

               Product line  Unit price
0         Health and beauty       74.69
1    Electronic accessories       15.28
2        Home and lifestyle       46.33
3         Health and beauty       58.22
4         Sports and travel       86.31
..                      ...         ...
995       Health and beauty       40.35
996      Home and lifestyle       97.38
997      Food and beverages       31.84
998      Home and lifestyle       65.82
999     Fashion accessories       88.34

[1000 rows x 2 columns]

In [9]:
## Ans 11
data = pd.read_csv('student data.csv')

In [10]:
data

   Student_Id  testscore
0           1         85
1           2         90
2           3         80
3           4         75
4           5         85
5           6         82
6           7         78
7           8         85
8           9         90
9          10         85

In [12]:
data=pd.DataFrame(data)

In [13]:
data

   Student_Id  testscore
0           1         85
1           2         90
2           3         80
3           4         75
4           5         85
5           6         82
6           7         78
7           8         85
8           9         90
9          10         85

In [14]:
data['testscore'].mean()

83.5

In [15]:
data['testscore'].mode()

0    85
Name: testscore, dtype: int64

In [16]:
data['testscore'].median()

85.0

In [17]:
data.describe()

       Student_Id  testscore
count    10.00000  10.000000
mean      5.50000  83.500000
std       3.02765   4.836206
min       1.00000  75.000000
25%       3.25000  80.500000
50%       5.50000  85.000000
75%       7.75000  85.000000
max      10.00000  90.000000